{
  "name": "burnout",
  "description": "Burnout awareness and advice",
  "modes": ["normal", "wholesome", "chaos", "sarcastic"],
  "examples": ["Remember to take breaks and rest.", "It's okay to ask for help."],
  "examplesByMode": {
    "normal": [
      "Remember to take breaks and rest.",
      "It's okay to ask for help.",
      "Prevent burnout by managing workload.",
      "Step away from the screen. Your eyes will thank you.",
      "Deferred work is not deleted work. Pace yourself.",
      "Sustainable pace beats heroic sprints.",
      "Take breaks. Your brain needs them.",
      "It's okay to say no to more work.",
      "Rest is part of the job. Really.",
      "Step away. The code will be there.",
      "Pace yourself. Marathons, not sprints. Literally.",
      "Ask for help before you're drowning.",
      "Boundaries are healthy. Set them.",
      "Sleep matters. So does lunch.",
      "You're not a machine. Act accordingly.",
      "Delegate when you can. It's not weakness.",
      "Time off is not optional. Take it.",
      "Sustainable pace wins. Every time.",
      "Your health is non-negotiable.",
      "Slow down. The work will still be there."
    ],
    "wholesome": [
      "You're doing great. It's okay to step back.",
      "Your health matters more than the sprint.",
      "Take that PTO. The code will still be here.",
      "You're enough. The tickets will wait.",
      "Rest isn't laziness. It's maintenance.",
      "Be kind to yourself. You've earned it.",
      "You matter. More than the deploy.",
      "It's okay to need a break. Take it.",
      "Your worth isn't your output. Remember that.",
      "Step back. Breathe. Then decide.",
      "You're allowed to have limits. Honor them.",
      "The team will survive without you for a week. Really.",
      "Rest. Recharge. You deserve it.",
      "Be gentle with yourself. You're trying."
    ],
    "chaos": [
      "You've been awake 32 hours. That's a personal best?",
      "Sleep is for people who aren't shipping. Jk. Sleep.",
      "The stack overflow isn't going to fix itself. But you need to.",
      "Your keyboard misses you. Go touch grass.",
      "Burnout speedrun: 47% complete. Please stop.",
      "You can't deploy from the ICU. Probably. Please rest.",
      "The pager can wait. Your sanity cannot. Probably.",
      "You've merged 47 PRs today. Tomorrow is a day too.",
      "Coffee is not a substitute for sleep. We've tried.",
      "The incident will be there tomorrow. So will you. Hopefully.",
      "Touch grass. Literally. The code will survive.",
      "Burnout: 60% complete. Achievement unlocked. Please stop.",
      "Your eyes are red. The pipeline is red. You need to log off.",
      "Rest. The deploy can wait. The deploy will always wait."
    ],
    "sarcastic": [
      "Self-care: responding to Slacks from the shower.",
      "Work-life balance: life is what happens between deploys.",
      "Boundaries: I don't check email. I check PagerDuty.",
      "Rest day: only 3 incident calls. Refreshed.",
      "Vacation: laptop in carry-on. For emergencies. All of them.",
      "Recharge: closed laptop. Opened laptop. Opened Slack.",
      "Self-care: I took a lunch. I ate at my desk. Progress.",
      "Boundaries: I only check Slack 47 times a day now.",
      "Rest: I didn't deploy this weekend. I thought about it.",
      "Work-life balance: life is the 5 minutes between meetings.",
      "Recharge: I closed one tab. Opened two. Net positive.",
      "Vacation: I'm out of office. My laptop is not.",
      "Self-care: I muted notifications. For an hour. It was scary.",
      "Rest: the pager didn't go off. I didn't trust it. I checked."
    ]
  }
}
